Revit 2024 API
FilterRule.ElementPasses Method
 Derived classes override this method to implement the test that determines whether the given element passes this rule or not.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public bool ElementPasses(
	Element element
)
Visual Basic
Public Function ElementPasses ( _
	element As Element _
) As Boolean
Visual C++
public:
bool ElementPasses(
	Element^ element
)
Parameters
element
Type: Autodesk.Revit.DB.Element
 The element to test against the rule.
Return Value
 True if the element satisfies the rule, false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
FilterRule Class
Autodesk.Revit.DB Namespace